Programação_Funcional/Nova pasta/prova02/enunciado/prova02.tex
% Created 2022-09-23 Fri 11:55
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fullpage}
\author{BCC222 - Programação funcional}
\date{}
\title{Simulação de Exploração de Minas Subterrâneas}
\hypersetup{
 pdfauthor={BCC222 - Programação funcional},
 pdftitle={Simulação de Exploração de Minas Subterrâneas},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Introdução}
\label{sec:orge262c58}

Com o avanço da tecnologia, robôs são cada vez mais utilizado em atividades
industriais que envolvem algum tipo de risco. Uma atividade que pode se beneficiar
da utilização de robôs é a mineração. Já que ao invés de exigir a presença humana em
minas subterrâneas, pode-se utilizar robôs para realizar a extração de minerais de
interesse. O objetivo deste trabalho é a implementação de um programa que simule a
execução de um robô em uma mina. Para isso, utilizaremos duas pequenas linguagens:
A LDM, Linguagem de Descrição de Mina, utilizada para descrever minas a serem
exploradas por robôs e a LCR, Linguagens de Comandos de Robô, utilizada para
descrever quais ações deverão ser executadas por um robo em uma mina.

As próximas seções descreverão estas linguagens e os tipos de dados necessários
para implementação deste trabalho.

\section{Tipos de dados utilizados}
\label{sec:org2aa089a}

\subsection{Representação de robôs}
\label{sec:orgfb9631c}

Primeiramente, precisamos de uma maneira de descrever robôs. A configuração, em um
dado instante, do robô durante o seu caminhamento na mina é formada pelas seguintes
informações:

\begin{itemize}
\item Total de energia: Representa o quanto de energia disponível o robô possui.
\item Posição Atual: Descreve em que ponto da mina o robô se encontra em um dado
momento. A posição de um robô é descrita como um par ordenado de números inteiros.
\item Material Coletado: Descreve a quantidade de material coletado pelo robô até
um certo instante.
\end{itemize}

Desta forma, podemos representar um robô pelo seguinte tipo de dados:

\begin{verbatim}
type Fuel = Int
type Point = (Int,Int)
type Material = Int

data Robot = Robot {
                energy    :: Fuel,
                position  :: Point,
                collected :: Material
             } deriving (Eq, Ord)
\end{verbatim}

Como exemplo deste tipo de dados, considere o seguinte robo de exemplo, que possui
\texttt{100} unidades de energia, está na posição \texttt{(1,1)} e não coletou material algum:

\begin{verbatim}
sampleRobot :: Robot
sampleRobot = Robot {
                energy = 100,
                position = (1,1),
                collected = 0
             }
\end{verbatim}

\subsubsection{Exercício 1.}
\label{sec:org6c3dcc9}

Implemente uma instância de \texttt{Show} para o tipo de
dados \texttt{Robot} de maneira que a função \texttt{show} quando
aplicada a \texttt{sampleRobot} produza a seguinte string:

\texttt{"Energy:100\textbackslash{}nPosition(1,1)\textbackslash{}nCollected:0"}


\subsection{Descrição de minas}
\label{sec:org410a7e2}

Uma mina é descrita por um modelo de seu mapa. Um mapa descreve um conjunto de pontos
da mina. Cada ponto da mina é descrito por seu conteúdo, que pode ser formado pelos
seguintes tipos de elementos:
\begin{itemize}
\item Posições vazias, que permitem que o robô caminhe livremente.
\item Entrada da mina, que pode ser utilizada para entrar e sair da mina.
\item Paredes, que são intransponíveis. Robôs não podem atravessá-las ou removê-las.
\item Terra, que pode ser removida pelo robô, ao custo de 5 unidades de energia.
\item Rochas, que podem ser removidas pelo robô, ao custo de 30 unidades de energia.
\item Materiais, que podem estar diferentes em concentrações no interior da mina.
\end{itemize}

A descrição de elementos da mina é representada pelo seguinte tipo de dados Haskell:

\begin{verbatim}
data Element = Empty         -- espaço vazio
             | Entry         -- entrada da mina
             | Wall          -- parede
             | Earth         -- terra
             | Rock          -- rocha
             | Material Int  -- material, Int indica quantidade.
             deriving (Eq,Ord)
\end{verbatim}

Para facilitar, vamos utilizar a seguinte convenção de mneumônicos para representar
elementos de uma mina:

\begin{center}
\begin{tabular}{ll}
Elemento & Mneumônico\\
espaço vazio & \\
Entrada da mina & \texttt{E}\\
Parede & \texttt{\%}\\
Terra & \texttt{.}\\
Rocha & \texttt{*}\\
50 de Material & \texttt{?}\\
100 de Material & \texttt{:}\\
150 de Material & \texttt{;}\\
Outras quantidades & \texttt{\$}\\
\end{tabular}
\end{center}

Outras quantidades de material devem ser consideradas como sendo uma unidade deste
material.

\subsubsection{Exercício 2.}
\label{sec:org9719489}

Utilizando a tabela de menumônicos anterior, apresente uma definição de \texttt{Show} para
o tipo de dados \texttt{Element}.

\subsubsection{Exercício 3.}
\label{sec:orgede2d17}

Apresente uma definição de um parser para o tipo \texttt{Element}.

\begin{verbatim}
pElement :: Parser Char Element
\end{verbatim}

A partir do tipo \texttt{Element}, podemos descrever uma mina, como sendo uma
matriz \(n\times m\) de elementos, em que \(n\) representa o número de linhas e \(m\) de
colunas. O tipo \texttt{Mine} é utilizado para descrever minas:

\begin{verbatim}
type Line = [Element]

data Mine = Mine {
              lines    :: Int,
              columns  :: Int,
              elements :: [Line]
            } deriving (Eq, Ord)  
\end{verbatim}


\subsubsection{Exercício 4}
\label{sec:org77ed190}

Consideramos que um valor do tipo \texttt{Mine} é válido
se a matriz de elementos possui o número de linhas e cada linha possui o número
de colunas especificado pelos campos \texttt{lines} e \texttt{columns}. Além diso,
uma mina deve ter pelo menos uma entrada e esta deve estar nas bordas da mina.
Implemente a função \texttt{validMine}, que retorna verdadeiro se uma mina é ou
não válida.

\begin{verbatim}
validMine :: Mine -> Bool
\end{verbatim}

\section{A linguagem de descrição de mina}
\label{sec:org409539a}

Especificações LDM nada mais são que uma descrição textual de uma mina.
O exemplo a seguir, ilustra uma especificação de uma mina de \(15\times 15\).

\begin{verbatim}
%%%%%%%%%%%%%%%
%***..........%
%***... ...*..%
%***... ..***.%
%.?.... ...*..%
%..     .. ...%
%.... .... ...%
%.:.. .... ...%
%.. .       ..%
%..*. .. .....%
%.... .. .;;..%
%.*.. ...;;..*%
%............$%
%.........   .%
%%%%%%%%%%%%%L%
\end{verbatim}

\subsubsection{Exercício 5}
\label{sec:org5bcba5d}

Apresente o valor do tipo \texttt{Mine} correspondente adescrição em LDM da mina \(15\times 15\) acima.

\begin{verbatim}
exampleMine :: Mine
\end{verbatim}

\subsubsection{Exercício 6}
\label{sec:orgff330b8}

Implemente um parser para o tipo \texttt{Mine}, que a partir de uma descrição em LDM, retorne um valor deste tipo.

\begin{verbatim}
pLine :: Parser Char Line

pMine :: Parser Char Mine
\end{verbatim}

\subsubsection{Exercício 7:}
\label{sec:org28b5c96}
Implemente uma instância de \texttt{Show} para o tipo de dados
\texttt{Mine}, de maneira que a string produzida pela função \texttt{show} seja
exatamente a especificação em LDM da mina.

\section{A Linguagem de Comandos de Robô}
\label{sec:orgad0ea33}

Robôs apenas executam comandos LCR. A LCR é também uma linguagem de mneumônicos
e possui apenas as seguintes intruções:

\begin{itemize}
\item \texttt{L}: Se o robô encontra-se na posição \((x,y)\), a instrução \texttt{L}.
faz com que o robô se mova para a posição \((x - 1,y)\).
\item \texttt{R}: Se o robô encontra-se na posição \((x,y)\), a instrução \texttt{R}
faz com que o robô se mova para a posição \((x + 1,y)\).
\item \texttt{U}: Se o robô encontra-se na posição \((x,y)\), a instrução \texttt{U}
faz com que o robô se mova para a posição \((x,y + 1)\).
\item \texttt{D}: Se o robô encontra-se na posição \((x,y)\), a instrução \texttt{D}
faz com que o robô se mova para a posição \((x,y-1)\).
\item \texttt{C}: Essa instrução faz com que o robô colete material, caso exista
material na vizinhança da posição atual do robô. Se o robô encontra-se na
posição \((x,y)\), a vizinhança é formada pelos seguintes pontos:
\((x+1,y)\), \((x-1,y)\),\((x,y+1)\) e \((x,y-1)\). Depois de coletar material,
esta posição deve ser atualizada para vazio (valor \texttt{Empty}).
\item \texttt{S}: Essa instrução faz com que o robô permaneça parado por uma
unidade de tempo. O efeito desta instrução é recarregar o robô em 1 unidade
de energia.
\end{itemize}

Cada instrução de movimento consome 1 unidade de energia do robô. A instrução de
coleta de materiais consome 10 unidades de energia.

O seguinte tipo de dados, representa instruções LCR:

\begin{verbatim}
data Instr = L -- move para esquerda
           | R -- move para direita
           | U -- move para cima
           | D -- move para baixo
           | C -- coleta material
           | S -- para para recarga.
           deriving (Eq,Ord,Show,Enum)
\end{verbatim}

\subsubsection{Exercício 8}
\label{sec:org308cc30}

Implemente um parser para o tipo \texttt{Instr}.

\begin{verbatim}
pInstr :: Parser Char Instr
pInstr = undefined
\end{verbatim}

Programas LCR consistem apenas de uma sequência de instruções. Considera-se que um
programa executa com sucesso se o robô entra na mina e sai por uma das entradas
desta.

\subsubsection{Exercício 9}
\label{sec:org6818cf1}

Um programa LCR consiste de uma string de mneumônicos sem
espaços. Desta forma, programas podem ser vistos como uma lista de instruções.
Implemente um parser para programas LCR.

\begin{verbatim}
pProgram :: Parser Char [Instr]
pProgram = undefined
\end{verbatim}

\subsection{Atualização da Mina}
\label{sec:orgc34f437}

Note que ao executar uma instrução, a mina deve ser atualizada de maneira apropriada.
Instruções executadas com sucesso transformam a posição atual no robô em uma posição vazia.
Dizemos que instruções são executas com sucesso se:

\begin{itemize}
\item A instrução \texttt{S} é sempre executada com sucesso.
\item Instruções de movimento são executadas se:
\begin{itemize}
\item O robô possui energia suficiente para executá-las.
\item A posição de destino do movimento não é uma parede da mina.
\end{itemize}
\item A instrução de coleta é executada com sucesso se o robô possui energia suficiente e
a vizinhança da posição atual do robô possui materiais. A vizinhança de um ponto
\((x,y)\) é formada pelo seguinte conjunto de pontos \(\{(x+1,y),(x-1,y),(x,y+1),(x,y-1)\}\).
A posição vizinha que possuir material coletado deve ser convertida para uma posição vazia.
\end{itemize}

Se uma instrução não pode ser executada com sucesso, o robô executa a instrução \texttt{S} e
tenta executar a próxima instrução do programa.

Para permitir o fluxo de alterações de valores do tipo de dados \texttt{Mine}, utilizaremos
uma mônada de estado para armazenar a configuração atual da execução do programa que é composta
pelo valor atual do robô e o valor atual da mina.

\begin{verbatim}
type Conf = (Robot, Mine)

type ConfM a = State Conf a
\end{verbatim}

\subsubsection{Exercício 10}
\label{sec:orgc680fbc}

Utilizando a mônada \texttt{ConfM}, implemente as seguintes funções
utilizadas para se obter componentes da configuração:

\begin{itemize}
\item A função \texttt{current} que retorna a posição atual do robô na mina.
\item A função \texttt{mine} que retorna a configuração atual da mina.
\item A função \texttt{enoughEnergy}, que retorna verdadeiro se
o valor de energia atual do robô é maior que o inteiro fornecido como parâmetro.
\item A função \texttt{incEnergy}, que incrementa por 1 o valor de energia atual
do robô.
\end{itemize}

\begin{verbatim}
current :: ConfM Point
current = undefined

mine :: ConfM Mine
mine = undefined

enoughEnergy :: Int -> ConfM Bool
enoughEnergy = undefined

incEnergy :: ConfM ()
incEnergy = undefined
\end{verbatim}

\subsubsection{Exercício 11}
\label{sec:org6a3386b}

Defina a função \texttt{valid :: Instr -> ConfM Bool} que determina
se uma instrução é ou não válida de acordo com as regras anteriores.

\begin{verbatim}
valid :: Instr -> ConfM Bool
valid = undefined
\end{verbatim}

\subsubsection{Exercício 12}
\label{sec:org89cfd0d}

Implemente a função \texttt{updateMine :: Instr -> ConfM ()}, que a
partir de uma instrução, atualiza a configuração da mina,
caso esta seja válida.

\begin{verbatim}
> updateMine :: Instr -> ConfM ()
> updateMine = undefined
\end{verbatim}

\subsection{Execução de Instruções}
\label{sec:org18f405a}

De posse de funções para determinar quando instruções são válidas e para atualizar
uma certa posição da mina, podemos definir a função que simula a execução de um robô em uma
dada mina. Caso a instrução seja válida, atualiza-se o robô e a mina de maneira apropriada,
caso contrário, a instrução executada deve ser \texttt{S}.

\subsubsection{Exercício 13}
\label{sec:orgdd72fda}

Implemente a função \texttt{exec} que executa uma instrução LCM, caso esta seja válida, e
atualiza a mina logo após a execução com sucesso desta.

\begin{verbatim}
> exec :: Instr -> ConfM ()
> exec = undefined
\end{verbatim}

\subsubsection{Exercício 14}
\label{sec:orgf1dd133}

Implemente a função \texttt{initRobot}, que a partir de um valor do tipo
\texttt{Mine}, retorne uma configuração inicial do robô explorador. Esta configuração inicial
deve atribuir um valor de 100 unidades de energia ao robô, como posição inicial deste, a
entrada da mina e como valor inicial de material coletado, 0.

\begin{verbatim}
initRobot :: Mine -> Robot
initRobot = undefined
\end{verbatim}

\subsubsection{Exercício 15}
\label{sec:org6c5d7c9}

Implemente a função \texttt{run}, que executa um programa LCM sobre uma
dada mina, retornando a configuração final desta como resultado.
Esta função deve receber como parâmetros o programa e a mina a ser explorada.

\begin{verbatim}
> run :: [Instr] -> Mine -> Mine
> run = undefined
\end{verbatim}

\section{Interface com o usuário}
\label{sec:orga7fa3ea}

\subsubsection{Exercício 16}
\label{sec:orgb42d073}

Implemente uma função para ler arquivos ".ldm", contendo descrições
de mina, retornando um valor de tipo \texttt{Mine} ou uma mensagem de erro indicando que
não foi possível realizar a leitura deste arquivo.

\begin{verbatim}
readLDM :: String -> IO (Either String Mine)
readLDM = undefined
\end{verbatim}

\subsubsection{Exercício 17}
\label{sec:org7d80f6d}

Implemente uma função para ler arquivos "lcr", contendo descrições
de comandos de robôs, retornando um valor do tipo \texttt{[Instr]} ou uma mensagem de erro
indicando que não foi possível realizar a leitura deste arquivo.

\begin{verbatim}
readLCR :: String -> IO (Either String [Instr])
readLCR = undefined
\end{verbatim}

Finalmente, a seguinte função chama as anteriores para executar os comandos de robô
especificados por um arquivo lcr sobre a mina descrita por um arquivo lcm, imprimindo
o resultado final da mina.

\begin{verbatim}
main :: IO ()
main = do
          args <- getArgs
          exec args

exec :: [String] -> IO ()
exec [fm , fr]
   = do
        pm <- readLDM fm
        pr <- readLCR fr
        let
           m = either error id pm
           r = either error id pr
           m' = run r m
        print m'
exec _ = putStrLn "Informe dois arquivos de entrada!"
\end{verbatim}

\section{Considerações Finais}
\label{sec:org4cc28b5}

\begin{itemize}
\item Este trabalho pode ser resolvido por grupos de até 3 alunos.

\item Plágios não serão tolerados. Qualquer tentativa de plágio
indentificada será punida com ZERO para todos os envolvidos.
Lembre-se que é melhor entregar uma solução incompleta ou
incorreta.

\item Entrega deverá ser feita usando o Moodle até o dia 14/10/2022. Você
deverá entregar somente um arquivo .zip contendo todo o projeto
stack de sua solução.
\end{itemize}
\end{document}